[Killed] BlockStatement
middleware.ts:10:56
  * @param request - The incoming Next.js request used to extract and refresh session state.
  * @returns The value returned by `updateSession` (typically a `NextResponse` that continues, redirects, or modifies the request).
  */
-export async function middleware(request: NextRequest) {
-  return await updateSession(request);
-}
+export async function middleware(request: NextRequest) {}
 
 export const config = {
killedBy: middleware calls updateSession with the provided request
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
